Управление_торговлей.ПБТ/src/Documents/УтверждениеНорматива/УтверждениеНорматива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеНорматива</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <basedOn>Document.УтверждениеНорматива</basedOn>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСырья</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребованияККачеству</name>
    <type>
      <types>DocumentRef.ТребованияККачествуЗакупаемогоТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодИсследования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСравнения</name>
      <type>
        <types>EnumRef.ВариантыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Интервал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Любая дополнительная информация</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Утвердил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/УтверждениеНорматива/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	Объект.ВидСырья = УправлениеСвойствами.ЗначениеСвойства(Объект.Номенклатура, "ВидПродукции(ВЕТИС)_5ee632ef8afb4eabac5c5c3b4babd429");   
	//Объект.ВидСырья = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "ВидСырья_86cd3104a2944c7681b702076074ab10");   
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзТребованияНаСервере()
	
	Требование = Объект.ТребованияККачеству;
	Если Не ЗначениеЗаполнено(Требование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Требование!");
		Возврат;
	КонецЕсли; 
	
	//Если НЕ Требование.Статус = Перечисления.СтатусЗаявки.Согласована И НЕ Требование.Статус = Перечисления.СтатусЗаявки.ТребованияСформированы Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У требования недопустимый статус!");
	//	Возврат;
	//КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("УтверждениеНорматива, ТребованияККачеству", Объект.Ссылка, Объект.ТребованияККачеству);
	ОповещениеОЗакрытие = Новый ОписаниеОповещения("ПослеЗакрытияФормыОбновленияИзТребования", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Уникальность, Окно, НавигационнаяСсылка, Владелец", Ложь);
	
	ОткрытьФорму("Документ.УтверждениеНорматива.Форма.ФормаОбновленияИзТребования", ПараметрыФормы,
	ЭтаФорма, ПараметрыОткрытияФормы.Уникальность,
	ПараметрыОткрытияФормы.Окно, ПараметрыОткрытияФормы.НавигационнаяСсылка, ОповещениеОЗакрытие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыОбновленияИзТребования(СтрукПараметров, ДопПараметры) Экспорт
	
    Если ТипЗнч(СтрукПараметров) = Тип("Структура") Тогда
        ЗагрузитьТЗВПоказатели(СтрукПараметров.АдресВХ);    
    КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТЗВПоказатели(АдресВХ)
	ТЗ = ПолучитьИзВременногоХранилища(АдресВХ);
	
	Для каждого Стр Из ТЗ Цикл
		Если НЕ СТр.Обновлять Тогда
			Продолжить;
		КонецЕсли; 
		
		ОтборЛ = Новый Структура();
		ОтборЛ.Вставить("Показатель", Стр.Показатель);
		
		СтрокиКонтроля = Объект.ТЧ_Показатели.НайтиСтроки(ОтборЛ);
		Если СтрокиКонтроля.Количество()=00 Тогда
			СтрКонтроля = Объект.ТЧ_Показатели.Добавить();
			СтрКонтроля.Показатель = Стр.Показатель;
		Иначе
			СтрКонтроля = СтрокиКонтроля[0];
		КонецЕсли;
		СтрКонтроля.ВидИсследования = Стр.ВидИсследованияТреб;
		СтрКонтроля.Значение = Стр.ЗначениеПоказателяТреб;
		СтрКонтроля.Периодичность = Стр.ПериодичностьТреб;
		СтрКонтроля.ВариантСравнения = Стр.ВариантСравненияТреб;
		СтрКонтроля.Интервал = Стр.ИнтервалТреб;
		//СтрКонтроля.ППК = Стр.ПериодичностьСторонняя;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзТребования(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		Ответ =Вопрос("Надо записать документ. Запишем?", РежимДиалогаВопрос.ДаНет);
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
		Объект.Записать();	
	КонецЕсли;
	
	ОбновитьИзТребованияНаСервере();
	
КонецПроцедуры
